---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertPercentToDouble
source: html/53bc538f-611e-ec04-f06f-596c94121aa5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertPercentToDouble Property

Cannot convert concentration percent ' [Percentage Value] ' to double value

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConvertPercentToDouble { get; }
```